Дошкольное_учреждение83/src/InformationRegisters/удуСведенияОЗачисленииРебенкаВГруппу/удуСведенияОЗачисленииРебенкаВГруппу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>удуСведенияОЗачисленииРебенкаВГруппу</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОснованиеЗачисления</name>
    <type>
      <types>DocumentRef.удуДоговорОЗачисленииРебенка</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеУчетаВГруппе</name>
    <type>
      <types>EnumRef.удуСостояниеРебенкаНаУчетеВГруппе</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаВыбытияИзГруппы</name>
    <type>
      <types>CatalogRef.удуПричиныВыбытияИзГруппы</types>
    </type>
  </resources>
  <dimensions>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ребенок</name>
    <type>
      <types>CatalogRef.удуДети</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Группа</name>
    <type>
      <types>CatalogRef.удуГруппыУчреждения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дошкольное_учреждение83/src/Enums/удуСостояниеРебенкаНаУчетеВГруппе/удуСостояниеРебенкаНаУчетеВГруппе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>удуСостояниеРебенкаНаУчетеВГруппе</name>
  <enumValues>
    <name>ПринятВГруппу</name>
  </enumValues>
  <enumValues>
    <name>ИсключенИзГруппы</name>
  </enumValues>
</mdclass:Enum>

Дошкольное_учреждение83/src/CommonModules/удуОбщегоНазначенияКлиентСервер/Module.bsl
//////////////////////////////////////////////////////////////////////////////// 
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ТАБЕЛЯ УЧЕТА ПОСЕЩАЕМОСТИ

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ТолстыйКлиентУправляемоеПриложение Тогда
	Функция СоставитьСписокДетейГруппы(Знач НаДату = Неопределено, 
		Знач ОкончаниеПериода = Неопределено, 
		Знач ГруппаДДУ, 
		РассчитатьЗадолженность = Ложь, 
		Знач Организация = Неопределено) Экспорт
	
	
	Если НаДату = Неопределено Тогда	
		НаДату = ТекущаяДатаСеанса();		
	КонецЕсли;	
	
	НаДату = НачалоДня(НаДату);	
	Если НЕ ОкончаниеПериода = Неопределено Тогда		
		ОкончаниеПериода = КонецДня(ОкончаниеПериода);		
		Если ОкончаниеПериода < НаДату	Тогда			
			Возврат Неопределено;				
		КонецЕсли;		
	КонецЕсли;
	
	Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("НаДату", НаДату);
	Запрос.УстановитьПараметр("ГруппаДДУ", ГруппаДДУ);
	Запрос.УстановитьПараметр("Учреждение", Организация);
	Запрос.Текст = "ВЫБРАТЬ
	               |	удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних.Ребенок,
	               |	удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних.Период,
	               |	удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних.Группа КАК ГруппаДетскогоУчреждения,
	               |	удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних.ОснованиеЗачисления.Ссылка КАК Договор,
	               |	удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних.ОснованиеЗачисления.ОплатаПоДоговору КАК СтавкаОплаты
	               |ИЗ
	               |	РегистрСведений.удуСведенияОЗачисленииРебенкаВГруппу.СрезПоследних(
	               |			&НаДату,
	               |			Учреждение = &Учреждение
	               |				И Группа = &ГруппаДДУ) КАК удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних
	               |ГДЕ
	               |	удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних.СостояниеУчетаВГруппе = ЗНАЧЕНИЕ(Перечисление.удуСостояниеРебенкаНаУчетеВГруппе.ПринятВГруппу)";
				   
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции	
#КонецЕсли
